# 1) Pandas Series

## Create a Series

In [1]:
import numpy as np
import pandas as pd

C:\Users\User\Anaconda3\lib\site-packages\pandas\compat\_optional.py:106: UserWarning: Pandas requires version '1.2.1' or newer of 'bottleneck' (version '1.2.0' currently installed).
  warnings.warn(msg, UserWarning)

In [2]:
# 1) Creating pandas series from a list

In [3]:
my_data = [10,20,30,40,50]
labels = ['a','b','c','d','e']

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
pd.Series(data = my_data,index=labels)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [7]:
# 2) Panda series using numpy array

In [8]:
arr = np.array(my_data)
arr

array([10, 20, 30, 40, 50])

In [9]:
pd.Series(data=arr)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [10]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [11]:
# 3ï¼‰ pandas series using a dict

In [12]:
d = {'a':100,'b':200,'c':300}

In [13]:
d

{'a': 100, 'b': 200, 'c': 300}

In [14]:
pd.Series(d)

a    100
b    200
c    300
dtype: int64

In [15]:
pd.Series(data=labels)

0    a
1    b
2    c
3    d
4    e
dtype: object

# Grab info from Pandas Series

In [16]:
ser1 = pd.Series(data=[1,2,3,4],index=['Red','Green','Ble','Orange'])
ser1

Red       1
Green     2
Ble       3
Orange    4
dtype: int64

In [17]:
ser2 = pd.Series(data=[1,2,5,4],index=['Red','Green','Yellow','Blue'])

In [18]:
ser2['Green']

2

In [20]:
ser1['Ble']

3

In [21]:
ser3 = pd.Series(data=['a','b','c','d','e'])
ser3

0    a
1    b
2    c
3    d
4    e
dtype: object

In [22]:
ser3[1]

'b'

In [23]:
ser3[0:3]

0    a
1    b
2    c
dtype: object

In [24]:
ser1

Red       1
Green     2
Ble       3
Orange    4
dtype: int64

In [25]:
ser2

Red       1
Green     2
Yellow    5
Blue      4
dtype: int64

In [26]:
ser1 + ser2

C:\Users\User\Anaconda3\lib\site-packages\pandas\compat\_optional.py:106: UserWarning: Pandas requires version '2.6.2' or newer of 'numexpr' (version '2.6.1' currently installed).
  warnings.warn(msg, UserWarning)

Ble       NaN
Blue      NaN
Green     4.0
Orange    NaN
Red       2.0
Yellow    NaN
dtype: float64

# 2) DataFrames

## DataFrames Part1

In [27]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [28]:
df = pd.DataFrame(data=randn(5,4),index=['a','b','c','d','e'],columns = ['w','x','y','z'])

In [29]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
# 1) Indexing and selection

In [31]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [32]:
type(df['w'])

pandas.core.series.Series

In [33]:
type(df)

pandas.core.frame.DataFrame

In [34]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [35]:
df[['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
c  0.740122  0.528813
d -0.758872 -0.933237
e  1.978757  2.605967

In [36]:
type(df[['x','y']])

pandas.core.frame.DataFrame

In [37]:
# 2) add a new column

In [38]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df['new'] = df['w'] + df['x']

In [40]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [41]:
# 3) Removing columns and rows

In [42]:
df.drop(labels = 'new',axis=1) #axis=1 means column, axis=0 means row

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [43]:
df.drop(labels = 'new',axis=1,inplace=True)

In [44]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [45]:
df.drop('b',axis=0)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [46]:
# 4) Selecting the rows

In [47]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [48]:
df.loc['c']

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [49]:
type(df.loc['c']) #df row is a series

pandas.core.series.Series

In [50]:
# selecting the subset of rows and cols

In [51]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [52]:
df.loc['c','x'] #select row c , col x

0.7401220570561068

In [53]:
df.loc[['d','e'],['y','z']] # select multiple row and col

          y         z
d -0.933237  0.955057
e  2.605967  0.683509

## DataFrames Part 2

In [54]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [56]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [58]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [59]:
# 1) conditional selection

In [60]:
df > 0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [61]:
b = df>0

In [62]:
b

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [64]:
df[b] # only shows the condition's value where equal to Trye

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [65]:
# specify condition on specific col

In [66]:
df['w'] > 0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [67]:
d = df['w'] > 0
d

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [68]:
df[d] # row where equal to False will not show up

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [69]:
# 2) multiple conditions at a time

In [70]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [71]:
df[(df['w']>0)& (df['y']>1)] #select df with col w >0, and col y >1

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [72]:
df[(df['w']>0) | (df['y']>1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [73]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [74]:
new_index = ['R','G','B','O','Y']

In [75]:
new_index

['R', 'G', 'B', 'O', 'Y']

In [76]:
df['Colors'] = new_index

In [77]:
df

          w         x         y         z Colors
a  2.706850  0.628133  0.907969  0.503826      R
b  0.651118 -0.319318 -0.848077  0.605965      G
c -2.018168  0.740122  0.528813 -0.589001      B
d  0.188695 -0.758872 -0.933237  0.955057      O
e  0.190794  1.978757  2.605967  0.683509      Y

In [78]:
# set col as index

In [79]:
df.set_index('Colors')

               w         x         y         z
Colors
R       2.706850  0.628133  0.907969  0.503826
G       0.651118 -0.319318 -0.848077  0.605965
B      -2.018168  0.740122  0.528813 -0.589001
O       0.188695 -0.758872 -0.933237  0.955057
Y       0.190794  1.978757  2.605967  0.683509

# DataFrames Part3

In [80]:
# multi-index and index hierarchy

In [81]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [82]:
outside = ['Red','Red','Red','Green','Green','Green']
inside = [1,2,3,1,2,3]

In [84]:
hier_index = list(zip(outside,inside))
hier_index

[('Red', 1), ('Red', 2), ('Red', 3), ('Green', 1), ('Green', 2), ('Green', 3)]

In [85]:
multi_index = pd.MultiIndex.from_tuples(hier_index,names=['Colors','Numbers'])

In [86]:
multi_index

MultiIndex([(  'Red', 1),
            (  'Red', 2),
            (  'Red', 3),
            ('Green', 1),
            ('Green', 2),
            ('Green', 3)],
           names=['Colors', 'Numbers'])

In [87]:
df = pd.DataFrame(data=randn(6,2),index=multi_index,columns=['A','B'])
df

                       A         B
Colors Numbers
Red    1        2.706850  0.628133
       2        0.907969  0.503826
       3        0.651118 -0.319318
Green  1       -0.848077  0.605965
       2       -2.018168  0.740122
       3        0.528813 -0.589001

In [88]:
# how to call multi index

In [89]:
df.loc['Red']

                A         B
Numbers
1        2.706850  0.628133
2        0.907969  0.503826
3        0.651118 -0.319318

In [92]:
df.loc['Red'].loc[1]['A'] # call COLOR INDEX = Red and Number Index = 1, column A values

2.706849839399938

In [93]:
df.loc['Green'].loc[2]['B']

0.7401220570561068

In [94]:
df.index.names #check index of dataframe

FrozenList(['Colors', 'Numbers'])

In [95]:
# rename index
df.index.names = ['Col','Num']
df

                  A         B
Col   Num
Red   1    2.706850  0.628133
      2    0.907969  0.503826
      3    0.651118 -0.319318
Green 1   -0.848077  0.605965
      2   -2.018168  0.740122
      3    0.528813 -0.589001

In [96]:
# cross section

In [97]:
df

                  A         B
Col   Num
Red   1    2.706850  0.628133
      2    0.907969  0.503826
      3    0.651118 -0.319318
Green 1   -0.848077  0.605965
      2   -2.018168  0.740122
      3    0.528813 -0.589001

In [98]:
df.loc['Red']

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [99]:
df.xs('Red') #cross section function

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [100]:
df.xs(1,level='Num')  #Key/Row =1, level = Num

              A         B
Col
Red    2.706850  0.628133
Green -0.848077  0.605965

# 3) Missing Data

In [101]:
import numpy as np
import pandas as pd

In [102]:
d = {'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[4,5,6]}
d

{'A': [1, 2, nan], 'B': [3, nan, nan], 'C': [4, 5, 6]}

In [103]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [104]:
# dropna method

In [105]:
df.dropna()

     A    B  C
0  1.0  3.0  4

In [106]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [108]:
df.dropna(thresh=2,axis=0) #drop row where there's 2 Nan

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [111]:
df.dropna(thresh=1,axis=1)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [112]:
# fillna method

In [113]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [114]:
df.fillna(value='New Value')

           A          B  C
0          1          3  4
1          2  New Value  5
2  New Value  New Value  6

In [115]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# 4) Groupby Method

In [117]:
import numpy as np
import pandas as pd

In [118]:
team_data={'Company':['Apple','Apple','FB','FB','Google','Google'],'Person':['Mark','Tom','John','Sara','Mia','Emma'],'Sales':[200,150,350,125,260,180]}
team_data

{'Company': ['Apple', 'Apple', 'FB', 'FB', 'Google', 'Google'],
 'Person': ['Mark', 'Tom', 'John', 'Sara', 'Mia', 'Emma'],
 'Sales': [200, 150, 350, 125, 260, 180]}

In [119]:
df = pd.DataFrame(team_data)
df

  Company Person  Sales
0   Apple   Mark    200
1   Apple    Tom    150
2      FB   John    350
3      FB   Sara    125
4  Google    Mia    260
5  Google   Emma    180

In [120]:
df.groupby(by='Company')

In [121]:
b = df.groupby(by='Company')
b

In [122]:
b.mean() #apply mean as aggregate function

         Sales
Company
Apple    175.0
FB       237.5
Google   220.0

In [124]:
b.sum()

         Sales
Company
Apple      350
FB         475
Google     440

In [125]:
b.std()

              Sales
Company
Apple     35.355339
FB       159.099026
Google    56.568542

In [126]:
b.sum().loc['Apple'] #specify the row

Sales    350
Name: Apple, dtype: int64

In [127]:
df.groupby(by='Company').sum()

         Sales
Company
Apple      350
FB         475
Google     440

In [128]:
df.groupby(by='Company').sum().loc['FB']

Sales    475
Name: FB, dtype: int64

In [129]:
b.count()

         Person  Sales
Company
Apple         2      2
FB            2      2
Google        2      2

In [130]:
b.max()

        Person  Sales
Company
Apple      Tom    200
FB        Sara    350
Google     Mia    260

In [133]:
b.min()

        Person  Sales
Company
Apple     Mark    150
FB        John    125
Google    Emma    180

In [134]:
# groupby method with describe function

In [135]:
df.groupby(by='Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
Apple     2.0  175.0   35.355339  150.0  162.50  175.0  187.50  200.0
FB        2.0  237.5  159.099026  125.0  181.25  237.5  293.75  350.0
Google    2.0  220.0   56.568542  180.0  200.00  220.0  240.00  260.0

In [136]:
df.groupby(by='Company').describe().transpose()

Company           Apple          FB      Google
Sales count    2.000000    2.000000    2.000000
      mean   175.000000  237.500000  220.000000
      std     35.355339  159.099026   56.568542
      min    150.000000  125.000000  180.000000
      25%    162.500000  181.250000  200.000000
      50%    175.000000  237.500000  220.000000
      75%    187.500000  293.750000  240.000000
      max    200.000000  350.000000  260.000000

In [137]:
df.groupby(by='Company').describe().loc['FB']

Sales  count      2.000000
       mean     237.500000
       std      159.099026
       min      125.000000
       25%      181.250000
       50%      237.500000
       75%      293.750000
       max      350.000000
Name: FB, dtype: float64

# 5) Merging, Joinng and Concatenating

In [138]:
import pandas as pd

## DataFrames Concatenation

In [142]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                     index = [0,1,2,3])

df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index = [4,5,6,7])

df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                    index = [8,9,10,11])

In [143]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [144]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [145]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [146]:
pd.concat(objs=[df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [147]:
pd.concat(objs=[df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## 2) DataFrames Merging

In [148]:
df4 = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

df5 = pd.DataFrame({'Key':['K0','K0','K1','K2'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [149]:
df4

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [150]:
df5

  Key   C   D
0  K0  C0  D0
1  K0  C1  D1
2  K1  C2  D2
3  K2  C3  D3

In [151]:
pd.merge(left=df4,right=df5,on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K0  A0  B0  C1  D1
2  K1  A1  B1  C2  D2
3  K2  A2  B2  C3  D3

In [156]:
df6 = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

df7 = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [157]:
df6

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [158]:
df7

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [159]:
pd.merge(left = df6,right = df7, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## 3) DataFrames Join

In [160]:
df8 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']},
                     index = ['K0','K1','K2','K3'])

df9 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                     index = ['K0','K1','K2','K3'])

In [161]:
df8

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [162]:
df9

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [163]:
df8.join(df9)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

# 6) Operations

In [164]:
import numpy as np
import pandas as pd

In [166]:
d = {'col1':[1,2,3,4],
     'col2':[45,55,65,45],
     'col3':['asd','jkl','qwe','xyz']}
d

{'col1': [1, 2, 3, 4],
 'col2': [45, 55, 65, 45],
 'col3': ['asd', 'jkl', 'qwe', 'xyz']}

In [167]:
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [168]:
df['col2'].unique()

array([45, 55, 65], dtype=int64)

In [169]:
len(df['col2'].unique())

3

In [170]:
df['col2'].nunique()

3

In [171]:
df['col2'].value_counts() #count the appearance of the value

45    2
55    1
65    1
Name: col2, dtype: int64

In [172]:
# apply method

In [173]:
def times5(x):
    return x*5

In [174]:
times5(10)

50

In [175]:
df['col1'].sum()

10

In [176]:
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [177]:
df['col1'].apply(times5)  #apply function called times5 by passing the column value

0     5
1    10
2    15
3    20
Name: col1, dtype: int64

In [178]:
df['col3'].apply(len) #apply len function with df[col3]

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [179]:
df.drop('col1',axis=1)

   col2 col3
0    45  asd
1    55  jkl
2    65  qwe
3    45  xyz

In [180]:
# check for column name
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [181]:
df.index # check for index

RangeIndex(start=0, stop=4, step=1)

In [182]:
# sort by specific col

df.sort_values('col2')

   col1  col2 col3
0     1    45  asd
3     4    45  xyz
1     2    55  jkl
2     3    65  qwe

In [183]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# 7) Reading and writing files in Pandas

In [184]:
import pandas as pd

In [185]:
pwd

'C:\\Users\\User\\Documents\\Python Scripts\\NLP'